kAMDSuccess = "ไม่มีข้อผิดพลาด";
kAMDUndefinedError = "ข้อผิดพลาดไม่มีชื่อเกิดขึ้น";
kAMDBadHeaderError = "ไม่สามารถโอนถ่ายไฟล์";
kAMDNoResourcesError = "ไม่สามารถจองทรัพยากร";
kAMDReadError = "ไม่สามารถอ่านจากอุปกรณ์";
kAMDWriteError = "ไม่สามารถเขียนอุปกรณ์";
kAMDUnknownPacketError = "Packet ไม่มีชื่อ";
kAMDInvalidArgumentError = "อาร์กิวเมนต์ไม่ถูกต้อง";
kAMDNotFoundError = "ไม่พบไฟล์";
kAMDIsDirectoryError = "เส้นทางเป็นไดเร็กทอรี";
kAMDPermissionError = "คุณไม่ได้รับสิทธิ์";
kAMDNotConnectedError = "ไม่ได้เชื่อมต่ออยู่กับอุปกรณ์";
kAMDTimeOutError = "การทำงานหมดเวลา";
kAMDOverrunError = "ที่จัดเก็บข้อมูลสำรองล้น";
kAMDEOFError = "ท้ายไฟล์";
kAMDUnsupportedError = "การทำงานนี้ไม่รองรับ";
kAMDFileExistsError = "ไฟล์มีอยู่แล้ว";
kAMDBusyError = "อุปกรณ์ไม่ว่าง";
kAMDCryptoError = "ไม่สามารถเริ่มสร้างการเชื่อมต่อปลอดภัยกับอุปกรณ์";
kAMDTooBigError = "ข้อความใหญ่เกินไป";
kAMDInvalidResponseError = "ได้รับการตอบกลับอย่างกระทันหันจากอุปกรณ์";
kAMDMissingKeyError = "กุญแจขาดไป";
kAMDMissingValueError = "ค่าขาดไป";
kAMDGetProhibitedError = "ไม่สามารถเรียกอ่านค่าจากอุปกรณ์ที่ล็อกรหัสอยู่";
kAMDSetProhibitedError = "ไม่สามารถตั้งค่ากับอุปกรณ์";
kAMDRemoveProhibitedError = "ไม่สามารถลบค่าออกจากอุปกรณ์";
kAMDImmutableValueError = "ค่านี้เปลี่ยนไม่ได้";
kAMDPasswordProtectedError = "อุปกรณ์มีรหัสป้องกัน";
kAMDMissingHostIDError = "อุปกรณ์ไม่รู้จักโฮสต์นี้";
kAMDInvalidHostIDError = "อุปกรณ์ไม่รู้จักโฮสต์นี้";
kAMDSessionActiveError = "เซ็สชั่นทำงานอยู่";
kAMDSessionInactiveError = "เซ็สชั่นไม่ได้ทำงานอยู่";
kAMDMissingSessionIDError = "ID ของเซ็สชั่นขาดไป";
kAMDInvalidSessionIDError = "ID ของเซ็สชั่นไม่ถูกต้อง";
kAMDMissingServiceError = "บริการขาดไป";
kAMDInvalidServiceError = "บริการไม่ถูกต้อง";
kAMDServiceLimitError = "บริการนี้ทำงานอยู่เป็นจำนวนมากเกินไป";
kAMDCheckinSetupFailedError = "ไม่สามารถเริ่มบริการบนอุปกรณ์";
kAMDInvalidCheckinError = "ไม่สามารถเริ่มบริการบนอุปกรณ์";
kAMDCheckinTimeoutError = "บริการบนอุปกรณ์เริ่มอย่างไม่ถูกต้อง";
kAMDCheckinConnectionFailedError = "บริการบนอุปกรณ์เริ่มอย่างไม่ถูกต้อง";
kAMDCheckinReceiveFailedError = "บริการบนอุปกรณ์เริ่มอย่างไม่ถูกต้อง";
kAMDCheckinResponseFailedError = "บริการบนอุปกรณ์เริ่มอย่างไม่ถูกต้อง";
kAMDCheckinOutOfMemoryError = "บริการบนอุปกรณ์เริ่มอย่างไม่ถูกต้อง";
kAMDCheckinSendFailedError = "บริการบนอุปกรณ์เริ่มอย่างไม่ถูกต้อง";
kAMDMissingPairRecordError = "โฮสต์ไม่ได้จับคู่กับอุปกรณ์";
kAMDInvalidPairRecordError = "โฮสต์ไม่ได้จับคู่กับอุปกรณ์อีกต่อไปแล้ว";
kAMDSavePairRecordFailedError = "ไม่สามารถบันทึกรายการข้อมูลการจับคู่";
kAMDInvalidActivationRecordError = "บันทึกการเปิดใช้งานไม่ถูกต้อง";
kAMDMissingActivationRecordError = "บันทึกการเปิดใช้งานไม่พบ";
kAMDServiceProhibitedError = "ไม่สามารถเริ่มบริการบนอุปกรณ์";
kAMDEscrowLockedError = "อุปกรณ์ไม่พร้อมจนกว่าจะปลดล็อกในครั้งแรกสุดหลังจากเปิดเครื่อง";
kAMDProhibitedBySupervision = "การทำงานห้ามไม่ให้ทำกับอุปกรณ์ที่ได้กำกับดูแลไว้";
kAMDPairingProhibitedError = "การจับคู่อนุญาตเฉพาะผ่านทาง USB เท่านั้น";
kAMDWrongDroidError = "อุปกรณ์อยู่ในสภาพกู้กลับคืน";
kAMDSUVerificationError = "แพ็กเกจของอัปเดตซอฟต์แวร์ยืนยันไม่ได้";
kAMDSUPatchError = "ไม่สามารถปะแก้ไฟล์";
kAMDSUFirmwareError = "ไม่สามารถอัปเดตเฟิร์มแวร์";
kAMDProvisioningProfileNotValid = "โปรไฟล์กำหนดสิทธิ์ไม่ถูกต้อง";
kAMDSendMessageError = "ไม่สามารถส่งข้อความไปที่อุปกรณ์";
kAMDReceiveMessageError = "ไม่สามารถรับข้อความจากอุปกรณ์";
kAMDMissingOptionsError = "ตัวเลือกขาดไป";
kAMDMissingImageTypeError = "รูปภาพขาดไป";
kAMDDigestFailedError = "ไม่สามารถอ่านภาพดิสก์";
kAMDStartServiceError = "บริการเริ่มไม่ได้";
kAMDInvalidDiskImageError = "ภาพดิสก์ไม่ถูกต้อง";
kAMDMissingDigestError = "การประมวลผลขาดไป";
kAMDMuxError = "เกิดข้อผิดพลาดกับอุปกรณ์รวมส่งสัญญาณแบบ USB";
kAMDApplicationAlreadyInstalledError = "แอปพลิเคชั่น (ตามตัวระบุบันเดิลที่ให้มา) ของระบบติดตั้งอยู่เรียบร้อยแล้วในอุปกรณ์และไม่สามารถแทนที่ได้";
kAMDApplicationMoveFailedError = "ไม่สามารถย้ายแอปพลิเคชั่นลงในอุปกรณ์";
//kAMDApplicationSINFCaptureFailedError = "";
kAMDApplicationSandboxFailedError = "แอปพลิเคชั่นไม่สามารถทดสอบกับกล่องทราย";
kAMDApplicationVerificationFailedError = "แอปพลิเคชั่นยืนยันไม่ได้";
kAMDArchiveDestructionFailedError = "ไม่สามารถลบไฟล์บีบอัดของแอปพลิเคชั่น";
kAMDBundleVerificationFailedError = "บันเดิลของผู้ให้บริการยืนยันไม่ได้";
kAMDCarrierBundleCopyFailedError = "ไม่สามารถติดตั้งบันเดิลของผู้ให้บริการ";
kAMDCarrierBundleDirectoryCreationFailedError = "ไม่สามารถสร้างไดเร็กทอรีสำหรับบันเดิลของผู้ให้บริการ";
kAMDCarrierBundleMissingSupportedSIMsError = "ไม่มีซิมที่รองรับกับบันเดิลของผู้ให้บริการนี้";
kAMDCommCenterNotificationFailedError = "ไม่สามารถรับฟังการแจ้งจากเบสแบนด์";
kAMDContainerCreationFailedError = "ไม่สามารถสร้างตัวบรรจุของแอปพลิเคชั่น";
kAMDContainerP0wnFailedError = "ไม่สามารถซ่อมสิทธิ์สำหรับตัวบรรจุของแอปพลิเคชั่น";
kAMDContainerRemovalFailedError = "ไม่สามารถลบตัวบรรจุของแอปพลิเคชั่น";
kAMDEmbeddedProfileInstallFailedError = "ไม่สามารถติดตั้งโปรไฟล์กำหนดสิทธิ์ที่ติดตั้งให้มากับเครื่อง";
kAMDErrorError = "ข้อผิดพลาดเกิดขึ้น";
kAMDExecutableTwiddleFailedError = "ไม่สามารถเปลี่ยนสิทธิ์ทำงานของแอปพลิเคชั่น";
kAMDExistenceCheckFailedError = "ไม่สามารถตรวจว่าแอปพลิเคชั่นมีอยู่แล้วหรือไม่";
kAMDInstallMapUpdateFailedError = "ไม่สามารถอัปเดตรายการแอปพลิเคชั่นที่ติดตั้ง";
kAMDManifestCaptureFailedError = "ไม่สามารถบันทึกรายการแอปพลิเคชั่น";
kAMDMapGenerationFailedError = "ไม่สามารถสร้างแผนที่";
kAMDMissingBundleExecutableError = "บันเดิลของแอปพลิเคชั่นไม่ได้ประกอบด้วยโปรแกรมปฏิบัติงาน";
kAMDMissingBundleIdentifierError = "บันเดิลของแอปพลิเคชั่นไม่ได้ประกอบด้วยตัวระบุที่ถูกต้อง";
kAMDMissingBundlePathError = "ไม่สามารถวิเคราะห์เส้นทางบันเดิลของแอปพลิเคชั่น";
kAMDMissingContainerError = "ไม่พบตัวบรรจุสำหรับแอปพลิเคชั่นที่ติดตั้ง";
kAMDNotificationFailedError = "ไม่สามารถโพสต์การแจ้ง";
kAMDPackageExtractionFailedError = "ไม่สามารถเปิดแพ็กเกจของแอปพลิเคชั่น";
kAMDPackageInspectionFailedError = "ไม่สามารถตรวจแพ็กเกจของแอปพลิเคชั่น";
kAMDPackageMoveFailedError = "ไม่สามารถย้ายแพ็กเกจของแอปพลิเคชั่นลงในบริเวณที่จัดไว้";
kAMDPathConversionFailedError = "ไม่สามารถแปลงเส้นทาง";
kAMDRestoreContainerFailedError = "ไม่สามารถกู้ตัวบรรจุของแอปพลิเคชั่นให้กลับคืน";
kAMDSeatbeltProfileRemovalFailedError = "ไม่สามารถลบโปรไฟล์ของแอปพลิเคชั่นรัดเข็มขัดที่นั่ง";
kAMDStageCreationFailedError = "ไม่สามารถสร้างไดเร็กทอรีจัดเตรียม";
kAMDSymlinkFailedError = "ไม่สามารถสร้างซิมลิงก์";
kAMDiTunesArtworkCaptureFailedError = "ไม่สามารถบันทึกปก iTunes";
kAMDiTunesMetadataCaptureFailedError = "ไม่สามารถบันทึกเมทาดาต้า iTunes";
kAMDAlreadyArchivedError = "แอปพลิเคชั่นได้ถูกจัดเก็บเรียบร้อยแล้ว";
kAMDUnknownCommandError = "อุปกรณ์ไม่รู้จักคำสั่ง";
kAMDAPIInternalError = "เกิดข้อผิดพลาด API ภายใน";
kAMDMuxCreateListenerError = "ไม่สามารถรับฟังสำหรับอุปกรณ์ USB";
kAMDMuxGetListenerError = "ไม่ได้รับการติดต่อทาง USB";
kAMDMuxConnectError = "ไม่สามารถเชื่อมต่ออุปกรณ์";
kAMDDeviceTooNewError = "จำเป็นต้องอัปเดตแอปพลิเคชั่นนี้";
kAMDDeviceRefNoGood = "อุปกรณ์นี้ไม่ได้ต่ออยู่อีกต่อไป";
kAMDDeviceDisconnectedError = "อุปกรณ์นี้ไม่ได้ต่ออยู่อีกต่อไป";
kAMDCannotTranslateError = "ไม่สามารถแปลข้อความจากอุปกรณ์";
kAMDMobileImageMounterMissingImageSignature = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterResponseCreationFailed = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterMissingImageType = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterMissingImagePath = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterImageMapLoadFailed = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterAlreadyMounted = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterImageMoveFailed = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterMountPathMissing = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterMountPathNotEmpty = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterImageMountFailed = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterTrustCacheLoadFailed = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterDigestFailed = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterDigestCreationFailed = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterImageVerificationFailed = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterImageInfoCreationFailed = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDMobileImageMounterImageMapStoreFailed = "ไม่รับรองการพัฒนาซอฟต์แวร์";
kAMDDeviceOSVersionTooLow = "เวอร์ชั่น OS ของอุปกรณ์เก่าเกินไป";
kAMDNoWifiSyncSupportError = "อุปกรณ์ไม่รองรับการเชื่อมข้อมูลอย่างไร้สาย";
kAMDDeviceFamilyNotSupported = "แอปพลิเคชั่นนี้ไม่รองรับอุปกรณ์ประเภทนี้";
kAMDPackagePatchFailedError = "ไม่สามารถปรับใช้อัปเดตปะแก้ให้กับแอปพลิเคชั่น";
kAMDIncorrectArchitectureError = "แอปพลิเคชั่นนี้รองรับประเภท CPU ของอุปกรณ์นี้ ";
kAMDPluginCopyFailedError = "ไม่สามารถคัดลอกปลั๊กอิน VPN ไว้ข้างในตัวบรรจุแอปฯ";
kAMDBreadcrumbFailedError = "ไม่สามารถเขียนแถบนำทางแสดงการติดตั้ง";
kAMDBreadcrumbUnlockError = "ไม่สามารถอัปเดตแถบนำทางแสดงการติดตั้ง";
kAMDGeoJSONCaptureFailedError = "ไม่สามารถบันทึกข้อมูล GeoJSON";
kAMDNewsstandArtworkCaptureFailedError = "ไม่สามารถบันทึกปกแผงหนังสือพิมพ์";
kAMDMissingCommandError = "การขอไม่ได้บรรจุคำสั่ง";
kAMDNotEntitledError = "แอปพลิเคชั่นที่กำลังขอไม่ได้รับอนุญาตให้ทำการขอนี้ได้";
kAMDMissingPackagePathError = "การขอขาดเส้นทางของแพ็กเกจ";
kAMDMissingContainerPathError = "การขอขาดเส้นทางของตัวบรรจุ";
kAMDMissingApplicationIdentifierError = "การขอขาดตัวระบุแอปพลิเคชั่น";
kAMDMissingAttributeValueError = "การขอขาดค่าบังคับ";
kAMDLookupFailedError = "ไม่สามารถแสดงรายการแอปพลิเคชั่นที่ติดตั้งอยู่";
kAMDDictCreationFailedError = "ไม่สามารถแยกความสามารถออกจากการขอ";

/* kMISFileError */
"A file operation failed." = "การทำงานเกี่ยวกับไฟล์ไม่สำเร็จ";

/* kMISModifiedResourcesError */
"A signed resource has been added, modified, or deleted." = "ทรัพยากรลงชื่อได้ถูกเพิ่ม ดัดแปลง หรือลบทิ้ง";

/* kMISInvalidSignerError */
"A valid provisioning profile for this executable was not found." = "ไม่พบโปรไฟล์กำหนดสิทธิ์ที่ถูกต้องสำหรับโปรแกรมนี้";

/* kMISUnknownError */
"An unknown error has occurred." = "ข้อผิดพลาดไม่มีชื่อได้เกิดขึ้น";

/* kMISNotMutableError */
"Attempted to modify an immutable provisioning profile." = "ได้เกิดความพยายามปรับเปลี่ยนโปรไฟล์กำหนดสิทธิ์ที่ไม่ให้เปลี่ยน";

/* kMISApplicationSignatureNotValidError */
"The application does not have a valid signature." = "แอปพลิเคชั่นไม่ได้ประกอบด้วยลายเซ็นที่ถูกต้อง";

/* kMISApplicationSignatureNotValidError */
"The application's signature is valid but it does not match the expected hash." = "ลายเซ็นของแอปพลิเคชั่นถูกต้อง แต่ไม่ตรงกับลายเซ็นที่อยู่ในที่เก็บข้อมูลแบบแฮชตามที่กำหนด";

/* kMISAdHocSignatureError */
"The executable contains an invalid signature." = "โปรแกรมปฏิบัติงานประกอบด้วยลายเซ็นไม่ถูกต้อง";

/* kMISInvalidEntitlementError */
"The executable was signed with invalid entitlements." = "โปรแกรมปฏิบัติงานได้ลงชื่อด้วยการให้ชื่อที่ไม่ถูกต้อง";

/* kMISInvalidSignerCertError */
"The identity used to sign the executable is no longer valid." = "ข้อมูลประจำตัวที่ใช้ลงชื่อโปรแกรมปฏิบัติงานใช้ไม่ได้อีกต่อไป";

/* kMISSignatureNotValidError */
"The signature was not valid." = "ลายเซ็นไม่ถูกต้อง";

/* kMISConnectionClosedError */
"There was an error communicating with your device." = "เกิดการสื่อสารผิดพลาดกับอุปกรณ์ของคุณ";

/* kMISUnsupportedDeviceError */
"This provisioning profile cannot be installed on this device." = "โปรไฟล์กำหนดสิทธิ์นี้ติดตั้งไม่ได้บนอุปกรณ์นี้";

/* kMISProfileSignatureNotValidError */
"This provisioning profile does not have a valid signature (or it has a valid, but untrusted signature)." = "โปรไฟล์กำหนดสิทธิ์นี้ไม่มีลายเซ็นที่ถูกต้อง (หรือเป็นลายเซ็นที่ถูกต้องแต่เชื่อถือไม่ได้)";

/* kMISExpiredError */
"This provisioning profile has expired." = "โปรไฟล์กำหนดสิทธิ์นี้ได้หมดเวลาแล้ว";

/* kMISMalformedProfileError */
"This provisioning profile is malformed." = "โปรไฟล์กำหนดสิทธิ์นี้เสียหาย";

/* kMISUnsupportedVersionError */
"This provisioning profile is unsupported." = "โปรไฟล์กำหนดสิทธิ์นี้ไม่รองรับ";

/* kMISAllocationError */
"Unable to allocate memory." = "ไม่สามารถจองหน่วยความจำ";

